---
kind: property
id: P:Autodesk.Revit.ApplicationServices.ControlledApplication.AllUsersAddinsLocation
source: html/83a42cb4-37dc-d985-ed37-9326b7d06bbd.htm
---
# Autodesk.Revit.ApplicationServices.ControlledApplication.AllUsersAddinsLocation Property

The folder location for .addin files for all users.

## Syntax (C#)
```csharp
public string AllUsersAddinsLocation { get; }
```